In [2]:
# Import libraries
import pandas as pd

In [4]:
# Read in CSV
file_path = "Resources/Employee.csv"
employee_df = pd.read_csv(file_path)
employee_df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

In [5]:
# Check for missing values
employee_df.isnull().sum()

Education                    0
JoiningYear                  0
City                         0
PaymentTier                  0
Age                          0
Gender                       0
EverBenched                  0
ExperienceInCurrentDomain    0
LeaveOrNot                   0
dtype: int64

In [8]:
# Check data types
employee_df.dtypes

Education                    object
JoiningYear                   int64
City                         object
PaymentTier                   int64
Age                           int64
Gender                       object
EverBenched                  object
ExperienceInCurrentDomain     int64
LeaveOrNot                    int64
dtype: object

In [11]:
# Overview of statistical data
employee_df.describe().round(2)

,JoiningYear,PaymentTier,Age,ExperienceInCurrentDomain,LeaveOrNot
count,4653.00,4653.00,4653.00,4653.00,4653.00
mean,2015.06,2.70,29.39,2.91,0.34
std,1.86,0.56,4.83,1.56,0.48
min,2012.00,1.00,22.00,0.00,0.00
25%,2013.00,3.00,26.00,2.00,0.00
50%,2015.00,3.00,28.00,3.00,0.00
75%,2017.00,3.00,32.00,4.00,1.00
max,2018.00,3.00,41.00,7.00,1.00

In [12]:
# Count duplicates (do not need to be removed)
employee_df.duplicated().sum()

1889

#### Cleaning Summary
- Data set is already clean for the requirements of our analysis. 
- Duplicates need not be removed because employee data is anonymous, so duplicate rows may simply be different employees with the same features.